\chapter{Virtual Local Area Networks (VLANs)}

\section{Switch User Manual}

You can download the switch user manual from here:

\url{http://www.jaumebarcelo.info/teaching/lxs/wlan/manual_vlan.pdf}

\section{Introduction}

In this lab assignment, we shall configure a Cisco switch to create different VLANs. The IP addresses of the lab switches are 192.168.1.110, 192.168.1.111 and 192.168.1.112. A sketch on the blackboard/whiteboard specifies the switch to which your PC is connected. Each VLAN has a unique identifier that takes values between 0 and 4094. In this lab assignment we shall use the identifiers 10 and 20.

Each group will use three computers. With one computer you shall manage the switch, and this compute requires an IP address in the same subnetwork as the address of the switch. Your instructor will give your further details. {\color{red}The IPs of the other two switches must belong to the range of the VLAN that you are going to use (192.168.\{10,20\}.XX).}

\section{Creation of a VLAN}

All Cisco switches used during this lab, use an operating system called the Cisco \emph{Internetwork Operating System}, or \emph{IOS}. The IOS features a command-line interface (CLI), which is accessible using a serial cable or a LAN Telnet connection.


\begin{table}
\sffamily\small
\centering
\begin{tabular}{l>{\columncolor{tablegray}}lp{8cm}}

\multicolumn{1}{>{\columncolor{tableheader}}c}{Command Mode} & \multicolumn{1}{>{\columncolor{tableorange}}c}{CLI Prompt} &
\multicolumn{1}{>{\columncolor{tableheader}}c}{Access}\\
User EXEC & \texttt{\color{blue}Switch\textgreater} & By default, when connecting to the switch for the first time, you are in this mode. \\
\hline
Privileged EXEC & \texttt{\color{blue}Switch\#} & From the \emph{User EXEC} mode, enter the \texttt{\color{blue}enable} command. \\
\hline
Global Configuration & \texttt{\color{blue}Switch(config)\#} & From the \emph{Privileged EXEC} mode, enter the \texttt{\color{blue}configure terminal} command. \\
\hline
Interface Configuration & \texttt{\color{blue}Switch(config-if)\#} & From the \emph{Global Configuration} mode, enter the \texttt{\color{blue}interface \textless if-name\textgreater}, where \texttt{\color{blue}if-name} is the name of the interface that we want to configure, such as \texttt{\color{blue}FastEthernet0/4} or \texttt{\color{blue}Fa0/4}. \\
\hline
\end{tabular}
\caption{Command modes of the Cisco IOS command-line interface}
\label{tab:IosModes}
\end{table}

We shall use the IOS command-line interface in four modes of operation, which are described in the table \ref{tab:IosModes}. As shown in the table, you can identify the current mode of operation according to the CLI prompt. The \emph{user EXEC} mode offers limited information about the switch. The \emph{privileged EXEC} mode allows us to access detailed information. The \emph{global configuration} mode enables us to configure the general aspects of the switch, whereas we can use the \emph{interface configuration} mode to configure a specific interface. The commands available in each of the modes are different. Make sure you are in the right mode before issuing a command. After entering a specific mode, it is possible to leave to the previous one using the command:

\begin{lstlisting}
exit
\end{lstlisting}

Use a Telnet client to connect to the switch and observe which is the initial mode. You can use the command:

\begin{lstlisting}
?
\end{lstlisting}
to obtain information about the possible commands in a given mode. Additionally, you can also follow a partial command by \texttt{\color{blue}?} to obtain more information about how to use the command and the required parameters. For example, the command:

\begin{lstlisting}
ip address ?
\end{lstlisting}
would give you information about the parameters you could use after address.

Enter the \emph{privileged EXEC} mode and use the command:
\begin{lstlisting}
Switch# show running-config
\end{lstlisting}
to see the current configuration of the switch.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Questions}\\
How many VLANs can you observe? \emph{Note that this is not necessarily the number of VLANs in the switch.}\\
\hline
How many Fast Ethernet interfaces are available?\\
\hline
What is the VLAN1 administrative address?\\
\hline
\end{tabular}
\end{center}

There exists a \emph{default} VLAN which has the number 1. Use the command:

\begin{lstlisting}
Switch# show vlan
\end{lstlisting}
or
\begin{lstlisting}
Switch# show vlan id <id>
\end{lstlisting}
to collect more information.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Questions}\\
What is the status of VLAN1?\\
\hline
How many VLANs are there in the switch? For each of the VLANs identify the ID, the name, the status, the assigned ports and the type. Include this information in the report.\\
\hline
\end{tabular}
\end{center}

Enter the \emph{global configuration} mode and try to delete the default VLAN.

\begin{lstlisting}
Switch(config)# no vlan 1
\end{lstlisting}

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
What happens?\\
\hline
\end{tabular}
\end{center}

Use the \texttt{\color{blue}?} command to find which commands can be used in this mode. Create a new VLAN with the command:

\begin{lstlisting}
Switch(config)# vlan <id>
\end{lstlisting}

The type of the VLAN is Ethernet and the \texttt{\color{blue}id} must be set according to the sketch you find on the blackboard/whiteboard. Include the exact command that you used and the reply message of the router in your report.

Verify the new configuration using the following command:

\begin{lstlisting}
Switch# show vlan
\end{lstlisting}
in the privileged EXEC mode.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
What is the default name of the new VLAN?\\
\hline
\end{tabular}
\end{center}

Delete the VLAN that you have just created using the command:

\begin{lstlisting}
Switch(config)# no vlan <id>
\end{lstlisting}
and verify that it has been deleted and create it again.

Include in your report the sequence of commands that you used and the output of the switch after each command. You can use the command:

\begin{lstlisting}
Switch# show vlan brief
\end{lstlisting}

In the \emph{global configuration} mode, use the command:

\begin{lstlisting}
Switch(config)# vlan <id>
\end{lstlisting}
to configure the VLAN that you have created. In the \emph{VLAN configuration} mode use the \texttt{\color{blue}name} command to change the name of the VLAN.

\begin{lstlisting}
Switch(config-vlan)# name <vlan-name>
\end{lstlisting}

Name your VLAN \texttt{\color{blue}vlanXX-GroupX-switchX}, and verify the changes. Include in your report the exact commands that you used and the output of the switch.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
Which other parameters can be changed in the VLAN configuration mode?\\
\hline
\end{tabular}
\end{center}

In the \emph{privileged EXEC} mode, take a look at the running configuration and compare it with the start-up configuration.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
Are they equal?\\
\hline
\end{tabular}
\end{center}

Find which are the commands that are needed to show the running configurations, and then to copy the running configuration to the start-up configuration. You will need this command when you make changes to the configuration that you want to save.

\section{Static Assignment of Ports to a VLAN}

After creating one or more VLANs, during the next step we assign ports to the VLANs. The simplest assignment is the \emph{static} assignment.

First, enter the \emph{global configuration} mode. Find out which are the ports that you want to modify (for example, 0/1, 0/2, etc.). Modify only the configuration of the ports that are assigned to the other two computers from your group. Make sure that you do not change the port that you are using for the Telnet connection.

To make the changes, you first have to go into to \emph{interface configuration} mode. Here, check the options of the \texttt{\color{blue}switchport} command and use the switch user manual if you require extra information. After making the changes, return to the \emph{privileged} mode. Verify the changes that you have made comparing the running configuration to the start-up configuration. Save your changes.

Use the \texttt{\color{blue}ping} command to test the connectivity between the two auxiliary computers. Try the connectivity between the configuration computer (the one that you use to connect to the switch CLI) to the auxiliary computers. Finally, try the connectivity between the computers of your group and computers of other groups in your class. Explain the results and the conclusions of the experiments, and complete the table \ref{tab:Connectivity}.

\begin{table}
\sffamily\small
\centering
\begin{tabular}{>{\columncolor{tablegray}}ccc}

\multicolumn{1}{c}{} & \multicolumn{1}{>{\columncolor{tablegray}}c}{Same switch} &
\multicolumn{1}{>{\columncolor{tablegray}}c}{Different switch} \\
Same VLAN & OK/KO & OK/KO \\
Different VLAN & OK/KO & OK/KO \\
\end{tabular}
\caption{Connectivity tests}
\label{tab:Connectivity}
\end{table}

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Questions}\\
Which devices are reached if you use a broadcast packet?\\
\hline
How can a packet travel from one VLAN to a different VLAN?\\
\hline
\end{tabular}
\end{center}

\section{Trunk Ports}

A trunk port can carry traffic of different VLANs between two switches. You will find which are the trunking ports on the blackboard/whiteboard. In the \emph{privileged EXEC} mode use the command:

\begin{lstlisting}
Switch(config)# show interfaces <interface> switchport
\end{lstlisting}

Write down the following parameters:
\begin{itemize}
\item Administrative mode
\item Operational mode
\item Administrative trunking encapsulation
\item Trunking native mode
\item Trunking VLAN enabled
\item Trunking VLAN active
\end{itemize}

Use the command:
\begin{lstlisting}
Switch(config)# show vlan
\end{lstlisting}
to check the status of the ports.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
Where can you find the trunk ports?\\
\hline
\end{tabular}
\end{center}

\section{Setup the VLANs Carried by a Trunk Port}

By default, a trunk port carries traffic of all VLANs. However, it is possible to configure which VLANs are allowed in a given trunk port. To accomplish this, from the \emph{privileged EXEC} mode, check which are the VLANs in the trunk port of your switch.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
Which command do you use?\\
\hline
\end{tabular}
\end{center}

In the \emph{global configuration} mode, enter into the configuration of the trunk port.
\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
Which command do you use?\\
\hline
\end{tabular}
\end{center}

Now we are going to configure the trunk port to allow the traffic of our VLAN.
Check the options of the command:

\begin{lstlisting}
Switch(config-if)# switchport trunk allowed vlan [remove | add] <vlan-list>
\end{lstlisting}

The parameter \texttt{\color{blue}vlan-list} is a list of VLAN identifiers (or names) separated by a hyphen (\texttt{\color{blue}-}) when specifying a VLAN range, or a comma (\texttt{\color{blue},}) when specifying a set of VLANs.

Exit the configuration mode and return to the \emph{privileged EXEC} mode. Use the commands:
\begin{lstlisting}
Switch# show interface interface-id status
\end{lstlisting}
or
\begin{lstlisting}
Switch# show interface status
\end{lstlisting}
to see the configuration of one or all the interfaces.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
What are the results?\\
\hline
\end{tabular}
\end{center}

Try also the command:

\begin{lstlisting}
Switch# show interfaces trunk
\end{lstlisting}
and write down the results.

\section{Connectivity Test}

Verify whether the following connections are possible and explain why.
\begin{itemize}
\item Ping a computer of the same VLAN, connected to a different switch.
\item Ping the switch of a different VLAN.
\item Perform additional tests (optional).
\end{itemize}

Compare the results that you obtain now with the results obtained in the static assignment of VLANs. Fill in the connectivity table \ref{tab:Connectivity} again.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Questions}\\
Are there any differences? Why?\\
\hline
\end{tabular}
\end{center}

Change the IP address of one of your auxiliary computers to an address belonging to the range of the other VLAN. Perform the connectivity tests again.

\begin{center}
\sffamily\small
\begin{tabular}{>{\columncolor{tablegray}}p{15cm}}

\multicolumn{1}{>{\columncolor{tableorange}}l}{Question}\\
What happens? Why?\\
\hline
\end{tabular}
\end{center}

\section{Network Topology}

Draw the network topology, both from the physical point of view and the logical point of view.

\section{Preparing the Report}

These are aspects that you may want to cover in your report:
\begin{itemize}
\item What is a VLAN and what is used for?
\item What are the differences among the different modes of the switch?
\item Relation between the active VLANs and the different ports.
\item Differences between access ports and trunk ports.
\item Connectivity in the different situations.
\item Remote management using Telnet and VLAN 1.
\end{itemize}

\section{Changing the Native VLAN (Optional)}

For security reasons, it is recommended to change the native VLAN of the switches (for example, to 666) and leave no ports assigned to that VLAN, except for administration.

\section{Speed and Duplexing (Optional)}

Change the speed of the port and the duplexing type and perform tests using \texttt{\color{blue}iperf}.

\section{Administrative Shutdown of an Interface (Optional)}

Try to administratively disable access ports and trunking ports and describe the results.
